/**
 * @file styles/tokens/colors.ts
 * @description
 * 定义了应用的基础色板 (Color Palette)。
 *
 * - **结构**: 按颜色名称 (如 `cyan`, `gray`) 分组，并使用数字 (如 100-900) 表示色阶，数值越大颜色越深。
 * - **用途**: 这些是与上下文无关的原始颜色值，是构成所有主题的基础。
 * - **规范**: 组件不应直接使用此文件中的颜色。所有颜色都应通过 `themes.ts` 中的语义化令牌进行引用。
 */
export const colorPalette = {
  cyan: {
    "400": "#62efff",
    "500": "#00bcd4",
    "800": "#008ba3",
  },
  purple: {
    "500": "#673ab7",
    "600": "#9a67ea",
  },
  gray: {
    "50": "#ffffff", // White
    "100": "#f4f7f6", // Lightest gray
    "200": "#e0e0e0",
    "300": "#dee2e6",
    "400": "#ccc",
    "600": "#767676",
    "700": "#666666",
    "800": "#333333",
    "900": "#212529",
    "950": "#0f0f0f",
  },
  blueGray: {
    "700": "#2b3a5b",
    "800": "#162447",
    "900": "#1a1a2e",
  },
  white: "#ffffff",
  black: "#000000",
  red: {
    "500": "#f44336",
  },
  green: {
    "500": "#4caf50",
  },
  orange: {
    "500": "#ffc107",
  },
  yellow: { "300": "#ffe0b2" },
};
